virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/uhphs.h
/*
 * Component description for UHPHS
 *
 * Copyright (c) 2021 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2021-06-28T09:00:02Z */
#ifndef _SAMA5D2_UHPHS_COMPONENT_H_
#define _SAMA5D2_UHPHS_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR UHPHS                                        */
/* ************************************************************************** */

/* -------- UHPHS_HCCAPBASE : (UHPHS Offset: 0x00) ( R/ 32) UHPHS Host Controller Capability Register -------- */
#define UHPHS_HCCAPBASE_CAPLENGTH_Pos         _U_(0)                                               /**< (UHPHS_HCCAPBASE) Capability Registers Length Position */
#define UHPHS_HCCAPBASE_CAPLENGTH_Msk         (_U_(0xFF) << UHPHS_HCCAPBASE_CAPLENGTH_Pos)         /**< (UHPHS_HCCAPBASE) Capability Registers Length Mask */
#define UHPHS_HCCAPBASE_CAPLENGTH(value)      (UHPHS_HCCAPBASE_CAPLENGTH_Msk & ((value) << UHPHS_HCCAPBASE_CAPLENGTH_Pos))
#define UHPHS_HCCAPBASE_HCIVERSION_Pos        _U_(16)                                              /**< (UHPHS_HCCAPBASE) Host Controller Interface Version Number Position */
#define UHPHS_HCCAPBASE_HCIVERSION_Msk        (_U_(0xFFFF) << UHPHS_HCCAPBASE_HCIVERSION_Pos)      /**< (UHPHS_HCCAPBASE) Host Controller Interface Version Number Mask */
#define UHPHS_HCCAPBASE_HCIVERSION(value)     (UHPHS_HCCAPBASE_HCIVERSION_Msk & ((value) << UHPHS_HCCAPBASE_HCIVERSION_Pos))
#define UHPHS_HCCAPBASE_Msk                   _U_(0xFFFF00FF)                                      /**< (UHPHS_HCCAPBASE) Register Mask  */


/* -------- UHPHS_HCSPARAMS : (UHPHS Offset: 0x04) ( R/ 32) UHPHS Host Controller Structural Parameters Register -------- */
#define UHPHS_HCSPARAMS_N_PORTS_Pos           _U_(0)                                               /**< (UHPHS_HCSPARAMS) Number of Ports Position */
#define UHPHS_HCSPARAMS_N_PORTS_Msk           (_U_(0xF) << UHPHS_HCSPARAMS_N_PORTS_Pos)            /**< (UHPHS_HCSPARAMS) Number of Ports Mask */
#define UHPHS_HCSPARAMS_N_PORTS(value)        (UHPHS_HCSPARAMS_N_PORTS_Msk & ((value) << UHPHS_HCSPARAMS_N_PORTS_Pos))
#define UHPHS_HCSPARAMS_PPC_Pos               _U_(4)                                               /**< (UHPHS_HCSPARAMS) Port Power Control Position */
#define UHPHS_HCSPARAMS_PPC_Msk               (_U_(0x1) << UHPHS_HCSPARAMS_PPC_Pos)                /**< (UHPHS_HCSPARAMS) Port Power Control Mask */
#define UHPHS_HCSPARAMS_PPC(value)            (UHPHS_HCSPARAMS_PPC_Msk & ((value) << UHPHS_HCSPARAMS_PPC_Pos))
#define UHPHS_HCSPARAMS_N_PCC_Pos             _U_(8)                                               /**< (UHPHS_HCSPARAMS) Number of Ports per Companion Controller Position */
#define UHPHS_HCSPARAMS_N_PCC_Msk             (_U_(0xF) << UHPHS_HCSPARAMS_N_PCC_Pos)              /**< (UHPHS_HCSPARAMS) Number of Ports per Companion Controller Mask */
#define UHPHS_HCSPARAMS_N_PCC(value)          (UHPHS_HCSPARAMS_N_PCC_Msk & ((value) << UHPHS_HCSPARAMS_N_PCC_Pos))
#define UHPHS_HCSPARAMS_N_CC_Pos              _U_(12)                                              /**< (UHPHS_HCSPARAMS) Number of Companion Controllers Position */
#define UHPHS_HCSPARAMS_N_CC_Msk              (_U_(0xF) << UHPHS_HCSPARAMS_N_CC_Pos)               /**< (UHPHS_HCSPARAMS) Number of Companion Controllers Mask */
#define UHPHS_HCSPARAMS_N_CC(value)           (UHPHS_HCSPARAMS_N_CC_Msk & ((value) << UHPHS_HCSPARAMS_N_CC_Pos))
#define UHPHS_HCSPARAMS_P_INDICATOR_Pos       _U_(16)                                              /**< (UHPHS_HCSPARAMS) Port Indicators Position */
#define UHPHS_HCSPARAMS_P_INDICATOR_Msk       (_U_(0x1) << UHPHS_HCSPARAMS_P_INDICATOR_Pos)        /**< (UHPHS_HCSPARAMS) Port Indicators Mask */
#define UHPHS_HCSPARAMS_P_INDICATOR(value)    (UHPHS_HCSPARAMS_P_INDICATOR_Msk & ((value) << UHPHS_HCSPARAMS_P_INDICATOR_Pos))
#define UHPHS_HCSPARAMS_N_DP_Pos              _U_(20)                                              /**< (UHPHS_HCSPARAMS) Debug Port Number Position */
#define UHPHS_HCSPARAMS_N_DP_Msk              (_U_(0xF) << UHPHS_HCSPARAMS_N_DP_Pos)               /**< (UHPHS_HCSPARAMS) Debug Port Number Mask */
#define UHPHS_HCSPARAMS_N_DP(value)           (UHPHS_HCSPARAMS_N_DP_Msk & ((value) << UHPHS_HCSPARAMS_N_DP_Pos))
#define UHPHS_HCSPARAMS_Msk                   _U_(0x00F1FF1F)                                      /**< (UHPHS_HCSPARAMS) Register Mask  */


/* -------- UHPHS_HCCPARAMS : (UHPHS Offset: 0x08) ( R/ 32) UHPHS Host Controller Capability Parameters Register -------- */
#define UHPHS_HCCPARAMS_AC_Pos                _U_(0)                                               /**< (UHPHS_HCCPARAMS) 64-bit Addressing Capability Position */
#define UHPHS_HCCPARAMS_AC_Msk                (_U_(0x1) << UHPHS_HCCPARAMS_AC_Pos)                 /**< (UHPHS_HCCPARAMS) 64-bit Addressing Capability Mask */
#define UHPHS_HCCPARAMS_AC(value)             (UHPHS_HCCPARAMS_AC_Msk & ((value) << UHPHS_HCCPARAMS_AC_Pos))
#define UHPHS_HCCPARAMS_PFLF_Pos              _U_(1)                                               /**< (UHPHS_HCCPARAMS) Programmable Frame List Flag Position */
#define UHPHS_HCCPARAMS_PFLF_Msk              (_U_(0x1) << UHPHS_HCCPARAMS_PFLF_Pos)               /**< (UHPHS_HCCPARAMS) Programmable Frame List Flag Mask */
#define UHPHS_HCCPARAMS_PFLF(value)           (UHPHS_HCCPARAMS_PFLF_Msk & ((value) << UHPHS_HCCPARAMS_PFLF_Pos))
#define UHPHS_HCCPARAMS_ASPC_Pos              _U_(2)                                               /**< (UHPHS_HCCPARAMS) Asynchronous Schedule Park Capability Position */
#define UHPHS_HCCPARAMS_ASPC_Msk              (_U_(0x1) << UHPHS_HCCPARAMS_ASPC_Pos)               /**< (UHPHS_HCCPARAMS) Asynchronous Schedule Park Capability Mask */
#define UHPHS_HCCPARAMS_ASPC(value)           (UHPHS_HCCPARAMS_ASPC_Msk & ((value) << UHPHS_HCCPARAMS_ASPC_Pos))
#define UHPHS_HCCPARAMS_IST_Pos               _U_(4)                                               /**< (UHPHS_HCCPARAMS) Isochronous Scheduling Threshold Position */
#define UHPHS_HCCPARAMS_IST_Msk               (_U_(0xF) << UHPHS_HCCPARAMS_IST_Pos)                /**< (UHPHS_HCCPARAMS) Isochronous Scheduling Threshold Mask */
#define UHPHS_HCCPARAMS_IST(value)            (UHPHS_HCCPARAMS_IST_Msk & ((value) << UHPHS_HCCPARAMS_IST_Pos))
#define UHPHS_HCCPARAMS_EECP_Pos              _U_(8)                                               /**< (UHPHS_HCCPARAMS) EHCI Extended Capabilities Pointer Position */
#define UHPHS_HCCPARAMS_EECP_Msk              (_U_(0xFF) << UHPHS_HCCPARAMS_EECP_Pos)              /**< (UHPHS_HCCPARAMS) EHCI Extended Capabilities Pointer Mask */
#define UHPHS_HCCPARAMS_EECP(value)           (UHPHS_HCCPARAMS_EECP_Msk & ((value) << UHPHS_HCCPARAMS_EECP_Pos))
#define UHPHS_HCCPARAMS_Msk                   _U_(0x0000FFF7)                                      /**< (UHPHS_HCCPARAMS) Register Mask  */


/* -------- UHPHS_USBCMD : (UHPHS Offset: 0x10) (R/W 32) UHPHS USB Command Register -------- */
#define UHPHS_USBCMD_RS_Pos                   _U_(0)                                               /**< (UHPHS_USBCMD) Run/Stop (read/write) Position */
#define UHPHS_USBCMD_RS_Msk                   (_U_(0x1) << UHPHS_USBCMD_RS_Pos)                    /**< (UHPHS_USBCMD) Run/Stop (read/write) Mask */
#define UHPHS_USBCMD_RS(value)                (UHPHS_USBCMD_RS_Msk & ((value) << UHPHS_USBCMD_RS_Pos))
#define UHPHS_USBCMD_HCRESET_Pos              _U_(1)                                               /**< (UHPHS_USBCMD) Host Controller Reset (read/write) Position */
#define UHPHS_USBCMD_HCRESET_Msk              (_U_(0x1) << UHPHS_USBCMD_HCRESET_Pos)               /**< (UHPHS_USBCMD) Host Controller Reset (read/write) Mask */
#define UHPHS_USBCMD_HCRESET(value)           (UHPHS_USBCMD_HCRESET_Msk & ((value) << UHPHS_USBCMD_HCRESET_Pos))
#define UHPHS_USBCMD_FLS_Pos                  _U_(2)                                               /**< (UHPHS_USBCMD) Frame List Size (read/write or read-only) Position */
#define UHPHS_USBCMD_FLS_Msk                  (_U_(0x3) << UHPHS_USBCMD_FLS_Pos)                   /**< (UHPHS_USBCMD) Frame List Size (read/write or read-only) Mask */
#define UHPHS_USBCMD_FLS(value)               (UHPHS_USBCMD_FLS_Msk & ((value) << UHPHS_USBCMD_FLS_Pos))
#define UHPHS_USBCMD_PSE_Pos                  _U_(4)                                               /**< (UHPHS_USBCMD) Periodic Schedule Enable (read/write) Position */
#define UHPHS_USBCMD_PSE_Msk                  (_U_(0x1) << UHPHS_USBCMD_PSE_Pos)                   /**< (UHPHS_USBCMD) Periodic Schedule Enable (read/write) Mask */
#define UHPHS_USBCMD_PSE(value)               (UHPHS_USBCMD_PSE_Msk & ((value) << UHPHS_USBCMD_PSE_Pos))
#define UHPHS_USBCMD_ASE_Pos                  _U_(5)                                               /**< (UHPHS_USBCMD) Asynchronous Schedule Enable (read/write) Position */
#define UHPHS_USBCMD_ASE_Msk                  (_U_(0x1) << UHPHS_USBCMD_ASE_Pos)                   /**< (UHPHS_USBCMD) Asynchronous Schedule Enable (read/write) Mask */
#define UHPHS_USBCMD_ASE(value)               (UHPHS_USBCMD_ASE_Msk & ((value) << UHPHS_USBCMD_ASE_Pos))
#define UHPHS_USBCMD_IAAD_Pos                 _U_(6)                                               /**< (UHPHS_USBCMD) Interrupt on Async Advance Doorbell (read/write) Position */
#define UHPHS_USBCMD_IAAD_Msk                 (_U_(0x1) << UHPHS_USBCMD_IAAD_Pos)                  /**< (UHPHS_USBCMD) Interrupt on Async Advance Doorbell (read/write) Mask */
#define UHPHS_USBCMD_IAAD(value)              (UHPHS_USBCMD_IAAD_Msk & ((value) << UHPHS_USBCMD_IAAD_Pos))
#define UHPHS_USBCMD_LHCR_Pos                 _U_(7)                                               /**< (UHPHS_USBCMD) Light Host Controller Reset (optional) (read/write) Position */
#define UHPHS_USBCMD_LHCR_Msk                 (_U_(0x1) << UHPHS_USBCMD_LHCR_Pos)                  /**< (UHPHS_USBCMD) Light Host Controller Reset (optional) (read/write) Mask */
#define UHPHS_USBCMD_LHCR(value)              (UHPHS_USBCMD_LHCR_Msk & ((value) << UHPHS_USBCMD_LHCR_Pos))
#define UHPHS_USBCMD_ASPMC_Pos                _U_(8)                                               /**< (UHPHS_USBCMD) Asynchronous Schedule Park Mode Count (optional) (read/write or read-only) Position */
#define UHPHS_USBCMD_ASPMC_Msk                (_U_(0x3) << UHPHS_USBCMD_ASPMC_Pos)                 /**< (UHPHS_USBCMD) Asynchronous Schedule Park Mode Count (optional) (read/write or read-only) Mask */
#define UHPHS_USBCMD_ASPMC(value)             (UHPHS_USBCMD_ASPMC_Msk & ((value) << UHPHS_USBCMD_ASPMC_Pos))
#define UHPHS_USBCMD_ASPME_Pos                _U_(11)                                              /**< (UHPHS_USBCMD) Asynchronous Schedule Park Mode Enable (optional) (read/write or read-only) Position */
#define UHPHS_USBCMD_ASPME_Msk                (_U_(0x1) << UHPHS_USBCMD_ASPME_Pos)                 /**< (UHPHS_USBCMD) Asynchronous Schedule Park Mode Enable (optional) (read/write or read-only) Mask */
#define UHPHS_USBCMD_ASPME(value)             (UHPHS_USBCMD_ASPME_Msk & ((value) << UHPHS_USBCMD_ASPME_Pos))
#define UHPHS_USBCMD_ITC_Pos                  _U_(16)                                              /**< (UHPHS_USBCMD) Interrupt Threshold Control (read/write) Position */
#define UHPHS_USBCMD_ITC_Msk                  (_U_(0xFF) << UHPHS_USBCMD_ITC_Pos)                  /**< (UHPHS_USBCMD) Interrupt Threshold Control (read/write) Mask */
#define UHPHS_USBCMD_ITC(value)               (UHPHS_USBCMD_ITC_Msk & ((value) << UHPHS_USBCMD_ITC_Pos))
#define UHPHS_USBCMD_Msk                      _U_(0x00FF0BFF)                                      /**< (UHPHS_USBCMD) Register Mask  */


/* -------- UHPHS_USBSTS : (UHPHS Offset: 0x14) (R/W 32) UHPHS USB Status Register -------- */
#define UHPHS_USBSTS_USBINT_Pos               _U_(0)                                               /**< (UHPHS_USBSTS) USB Interrupt (read/write clear) Position */
#define UHPHS_USBSTS_USBINT_Msk               (_U_(0x1) << UHPHS_USBSTS_USBINT_Pos)                /**< (UHPHS_USBSTS) USB Interrupt (read/write clear) Mask */
#define UHPHS_USBSTS_USBINT(value)            (UHPHS_USBSTS_USBINT_Msk & ((value) << UHPHS_USBSTS_USBINT_Pos))
#define UHPHS_USBSTS_USBERRINT_Pos            _U_(1)                                               /**< (UHPHS_USBSTS) USB Error Interrupt (read/write clear) Position */
#define UHPHS_USBSTS_USBERRINT_Msk            (_U_(0x1) << UHPHS_USBSTS_USBERRINT_Pos)             /**< (UHPHS_USBSTS) USB Error Interrupt (read/write clear) Mask */
#define UHPHS_USBSTS_USBERRINT(value)         (UHPHS_USBSTS_USBERRINT_Msk & ((value) << UHPHS_USBSTS_USBERRINT_Pos))
#define UHPHS_USBSTS_PCD_Pos                  _U_(2)                                               /**< (UHPHS_USBSTS) Port Change Detect (read/write clear) Position */
#define UHPHS_USBSTS_PCD_Msk                  (_U_(0x1) << UHPHS_USBSTS_PCD_Pos)                   /**< (UHPHS_USBSTS) Port Change Detect (read/write clear) Mask */
#define UHPHS_USBSTS_PCD(value)               (UHPHS_USBSTS_PCD_Msk & ((value) << UHPHS_USBSTS_PCD_Pos))
#define UHPHS_USBSTS_FLR_Pos                  _U_(3)                                               /**< (UHPHS_USBSTS) Frame List Rollover (read/write clear) Position */
#define UHPHS_USBSTS_FLR_Msk                  (_U_(0x1) << UHPHS_USBSTS_FLR_Pos)                   /**< (UHPHS_USBSTS) Frame List Rollover (read/write clear) Mask */
#define UHPHS_USBSTS_FLR(value)               (UHPHS_USBSTS_FLR_Msk & ((value) << UHPHS_USBSTS_FLR_Pos))
#define UHPHS_USBSTS_HSE_Pos                  _U_(4)                                               /**< (UHPHS_USBSTS) Host System Error (read/write clear) Position */
#define UHPHS_USBSTS_HSE_Msk                  (_U_(0x1) << UHPHS_USBSTS_HSE_Pos)                   /**< (UHPHS_USBSTS) Host System Error (read/write clear) Mask */
#define UHPHS_USBSTS_HSE(value)               (UHPHS_USBSTS_HSE_Msk & ((value) << UHPHS_USBSTS_HSE_Pos))
#define UHPHS_USBSTS_IAA_Pos                  _U_(5)                                               /**< (UHPHS_USBSTS) Interrupt on Async Advance (read/write clear) Position */
#define UHPHS_USBSTS_IAA_Msk                  (_U_(0x1) << UHPHS_USBSTS_IAA_Pos)                   /**< (UHPHS_USBSTS) Interrupt on Async Advance (read/write clear) Mask */
#define UHPHS_USBSTS_IAA(value)               (UHPHS_USBSTS_IAA_Msk & ((value) << UHPHS_USBSTS_IAA_Pos))
#define UHPHS_USBSTS_HCHLT_Pos                _U_(12)                                              /**< (UHPHS_USBSTS) HCHalted (read-only) Position */
#define UHPHS_USBSTS_HCHLT_Msk                (_U_(0x1) << UHPHS_USBSTS_HCHLT_Pos)                 /**< (UHPHS_USBSTS) HCHalted (read-only) Mask */
#define UHPHS_USBSTS_HCHLT(value)             (UHPHS_USBSTS_HCHLT_Msk & ((value) << UHPHS_USBSTS_HCHLT_Pos))
#define UHPHS_USBSTS_RCM_Pos                  _U_(13)                                              /**< (UHPHS_USBSTS) Reclamation (read-only) Position */
#define UHPHS_USBSTS_RCM_Msk                  (_U_(0x1) << UHPHS_USBSTS_RCM_Pos)                   /**< (UHPHS_USBSTS) Reclamation (read-only) Mask */
#define UHPHS_USBSTS_RCM(value)               (UHPHS_USBSTS_RCM_Msk & ((value) << UHPHS_USBSTS_RCM_Pos))
#define UHPHS_USBSTS_PSS_Pos                  _U_(14)                                              /**< (UHPHS_USBSTS) Periodic Schedule Status (read-only) Position */
#define UHPHS_USBSTS_PSS_Msk                  (_U_(0x1) << UHPHS_USBSTS_PSS_Pos)                   /**< (UHPHS_USBSTS) Periodic Schedule Status (read-only) Mask */
#define UHPHS_USBSTS_PSS(value)               (UHPHS_USBSTS_PSS_Msk & ((value) << UHPHS_USBSTS_PSS_Pos))
#define UHPHS_USBSTS_ASS_Pos                  _U_(15)                                              /**< (UHPHS_USBSTS) Asynchronous Schedule Status (read-only) Position */
#define UHPHS_USBSTS_ASS_Msk                  (_U_(0x1) << UHPHS_USBSTS_ASS_Pos)                   /**< (UHPHS_USBSTS) Asynchronous Schedule Status (read-only) Mask */
#define UHPHS_USBSTS_ASS(value)               (UHPHS_USBSTS_ASS_Msk & ((value) << UHPHS_USBSTS_ASS_Pos))
#define UHPHS_USBSTS_Msk                      _U_(0x0000F03F)                                      /**< (UHPHS_USBSTS) Register Mask  */


/* -------- UHPHS_USBINTR : (UHPHS Offset: 0x18) (R/W 32) UHPHS USB Interrupt Enable Register -------- */
#define UHPHS_USBINTR_USBIE_Pos               _U_(0)                                               /**< (UHPHS_USBINTR) USB Interrupt Enable Position */
#define UHPHS_USBINTR_USBIE_Msk               (_U_(0x1) << UHPHS_USBINTR_USBIE_Pos)                /**< (UHPHS_USBINTR) USB Interrupt Enable Mask */
#define UHPHS_USBINTR_USBIE(value)            (UHPHS_USBINTR_USBIE_Msk & ((value) << UHPHS_USBINTR_USBIE_Pos))
#define UHPHS_USBINTR_USBEIE_Pos              _U_(1)                                               /**< (UHPHS_USBINTR) USB Error Interrupt Enable Position */
#define UHPHS_USBINTR_USBEIE_Msk              (_U_(0x1) << UHPHS_USBINTR_USBEIE_Pos)               /**< (UHPHS_USBINTR) USB Error Interrupt Enable Mask */
#define UHPHS_USBINTR_USBEIE(value)           (UHPHS_USBINTR_USBEIE_Msk & ((value) << UHPHS_USBINTR_USBEIE_Pos))
#define UHPHS_USBINTR_PCIE_Pos                _U_(2)                                               /**< (UHPHS_USBINTR) Port Change Interrupt Enable Position */
#define UHPHS_USBINTR_PCIE_Msk                (_U_(0x1) << UHPHS_USBINTR_PCIE_Pos)                 /**< (UHPHS_USBINTR) Port Change Interrupt Enable Mask */
#define UHPHS_USBINTR_PCIE(value)             (UHPHS_USBINTR_PCIE_Msk & ((value) << UHPHS_USBINTR_PCIE_Pos))
#define UHPHS_USBINTR_FLRE_Pos                _U_(3)                                               /**< (UHPHS_USBINTR) Frame List Rollover Enable Position */
#define UHPHS_USBINTR_FLRE_Msk                (_U_(0x1) << UHPHS_USBINTR_FLRE_Pos)                 /**< (UHPHS_USBINTR) Frame List Rollover Enable Mask */
#define UHPHS_USBINTR_FLRE(value)             (UHPHS_USBINTR_FLRE_Msk & ((value) << UHPHS_USBINTR_FLRE_Pos))
#define UHPHS_USBINTR_HSEE_Pos                _U_(4)                                               /**< (UHPHS_USBINTR) Host System Error Enable Position */
#define UHPHS_USBINTR_HSEE_Msk                (_U_(0x1) << UHPHS_USBINTR_HSEE_Pos)                 /**< (UHPHS_USBINTR) Host System Error Enable Mask */
#define UHPHS_USBINTR_HSEE(value)             (UHPHS_USBINTR_HSEE_Msk & ((value) << UHPHS_USBINTR_HSEE_Pos))
#define UHPHS_USBINTR_IAAE_Pos                _U_(5)                                               /**< (UHPHS_USBINTR) Interrupt on Async Advance Enable Position */
#define UHPHS_USBINTR_IAAE_Msk                (_U_(0x1) << UHPHS_USBINTR_IAAE_Pos)                 /**< (UHPHS_USBINTR) Interrupt on Async Advance Enable Mask */
#define UHPHS_USBINTR_IAAE(value)             (UHPHS_USBINTR_IAAE_Msk & ((value) << UHPHS_USBINTR_IAAE_Pos))
#define UHPHS_USBINTR_Msk                     _U_(0x0000003F)                                      /**< (UHPHS_USBINTR) Register Mask  */


