virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/uhphs.h
/* -------- UHPHS_FRINDEX : (UHPHS Offset: 0x1C) (R/W 32) UHPHS USB Frame Index Register -------- */
#define UHPHS_FRINDEX_FI_Pos                  _U_(0)                                               /**< (UHPHS_FRINDEX) Frame Index Position */
#define UHPHS_FRINDEX_FI_Msk                  (_U_(0x3FFF) << UHPHS_FRINDEX_FI_Pos)                /**< (UHPHS_FRINDEX) Frame Index Mask */
#define UHPHS_FRINDEX_FI(value)               (UHPHS_FRINDEX_FI_Msk & ((value) << UHPHS_FRINDEX_FI_Pos))
#define UHPHS_FRINDEX_Msk                     _U_(0x00003FFF)                                      /**< (UHPHS_FRINDEX) Register Mask  */


/* -------- UHPHS_CTRLDSSEGMENT : (UHPHS Offset: 0x20) (R/W 32) UHPHS Control Data Structure Segment Register -------- */
#define UHPHS_CTRLDSSEGMENT_Msk               _U_(0x00000000)                                      /**< (UHPHS_CTRLDSSEGMENT) Register Mask  */


/* -------- UHPHS_PERIODICLISTBASE : (UHPHS Offset: 0x24) (R/W 32) UHPHS Periodic Frame List Base Address Register -------- */
#define UHPHS_PERIODICLISTBASE_BA_Pos         _U_(12)                                              /**< (UHPHS_PERIODICLISTBASE) Base Address (Low) Position */
#define UHPHS_PERIODICLISTBASE_BA_Msk         (_U_(0xFFFFF) << UHPHS_PERIODICLISTBASE_BA_Pos)      /**< (UHPHS_PERIODICLISTBASE) Base Address (Low) Mask */
#define UHPHS_PERIODICLISTBASE_BA(value)      (UHPHS_PERIODICLISTBASE_BA_Msk & ((value) << UHPHS_PERIODICLISTBASE_BA_Pos))
#define UHPHS_PERIODICLISTBASE_Msk            _U_(0xFFFFF000)                                      /**< (UHPHS_PERIODICLISTBASE) Register Mask  */


/* -------- UHPHS_ASYNCLISTADDR : (UHPHS Offset: 0x28) (R/W 32) UHPHS Asynchronous List Address Register -------- */
#define UHPHS_ASYNCLISTADDR_LPL_Pos           _U_(5)                                               /**< (UHPHS_ASYNCLISTADDR) Link Pointer Low Position */
#define UHPHS_ASYNCLISTADDR_LPL_Msk           (_U_(0x7FFFFFF) << UHPHS_ASYNCLISTADDR_LPL_Pos)      /**< (UHPHS_ASYNCLISTADDR) Link Pointer Low Mask */
#define UHPHS_ASYNCLISTADDR_LPL(value)        (UHPHS_ASYNCLISTADDR_LPL_Msk & ((value) << UHPHS_ASYNCLISTADDR_LPL_Pos))
#define UHPHS_ASYNCLISTADDR_Msk               _U_(0xFFFFFFE0)                                      /**< (UHPHS_ASYNCLISTADDR) Register Mask  */


/* -------- UHPHS_CONFIGFLAG : (UHPHS Offset: 0x50) (R/W 32) UHPHS Configured Flag Register -------- */
#define UHPHS_CONFIGFLAG_CF_Pos               _U_(0)                                               /**< (UHPHS_CONFIGFLAG) Configure Flag (read/write) Position */
#define UHPHS_CONFIGFLAG_CF_Msk               (_U_(0x1) << UHPHS_CONFIGFLAG_CF_Pos)                /**< (UHPHS_CONFIGFLAG) Configure Flag (read/write) Mask */
#define UHPHS_CONFIGFLAG_CF(value)            (UHPHS_CONFIGFLAG_CF_Msk & ((value) << UHPHS_CONFIGFLAG_CF_Pos))
#define UHPHS_CONFIGFLAG_Msk                  _U_(0x00000001)                                      /**< (UHPHS_CONFIGFLAG) Register Mask  */


/* -------- UHPHS_PORTSC_0 : (UHPHS Offset: 0x54) (R/W 32) UHPHS Port Status and Control Register 0 -------- */
#define UHPHS_PORTSC_0_CCS_Pos                _U_(0)                                               /**< (UHPHS_PORTSC_0) Current Connect Status (read-only) Position */
#define UHPHS_PORTSC_0_CCS_Msk                (_U_(0x1) << UHPHS_PORTSC_0_CCS_Pos)                 /**< (UHPHS_PORTSC_0) Current Connect Status (read-only) Mask */
#define UHPHS_PORTSC_0_CCS(value)             (UHPHS_PORTSC_0_CCS_Msk & ((value) << UHPHS_PORTSC_0_CCS_Pos))
#define UHPHS_PORTSC_0_CSC_Pos                _U_(1)                                               /**< (UHPHS_PORTSC_0) Connect Status Change (read/write clear) Position */
#define UHPHS_PORTSC_0_CSC_Msk                (_U_(0x1) << UHPHS_PORTSC_0_CSC_Pos)                 /**< (UHPHS_PORTSC_0) Connect Status Change (read/write clear) Mask */
#define UHPHS_PORTSC_0_CSC(value)             (UHPHS_PORTSC_0_CSC_Msk & ((value) << UHPHS_PORTSC_0_CSC_Pos))
#define UHPHS_PORTSC_0_PED_Pos                _U_(2)                                               /**< (UHPHS_PORTSC_0) Port Enabled/Disabled (read/write) Position */
#define UHPHS_PORTSC_0_PED_Msk                (_U_(0x1) << UHPHS_PORTSC_0_PED_Pos)                 /**< (UHPHS_PORTSC_0) Port Enabled/Disabled (read/write) Mask */
#define UHPHS_PORTSC_0_PED(value)             (UHPHS_PORTSC_0_PED_Msk & ((value) << UHPHS_PORTSC_0_PED_Pos))
#define UHPHS_PORTSC_0_PEDC_Pos               _U_(3)                                               /**< (UHPHS_PORTSC_0) Port Enable/Disable Change (read/write clear) Position */
#define UHPHS_PORTSC_0_PEDC_Msk               (_U_(0x1) << UHPHS_PORTSC_0_PEDC_Pos)                /**< (UHPHS_PORTSC_0) Port Enable/Disable Change (read/write clear) Mask */
#define UHPHS_PORTSC_0_PEDC(value)            (UHPHS_PORTSC_0_PEDC_Msk & ((value) << UHPHS_PORTSC_0_PEDC_Pos))
#define UHPHS_PORTSC_0_OCA_Pos                _U_(4)                                               /**< (UHPHS_PORTSC_0) Over-current Active (read-only) Position */
#define UHPHS_PORTSC_0_OCA_Msk                (_U_(0x1) << UHPHS_PORTSC_0_OCA_Pos)                 /**< (UHPHS_PORTSC_0) Over-current Active (read-only) Mask */
#define UHPHS_PORTSC_0_OCA(value)             (UHPHS_PORTSC_0_OCA_Msk & ((value) << UHPHS_PORTSC_0_OCA_Pos))
#define UHPHS_PORTSC_0_OCC_Pos                _U_(5)                                               /**< (UHPHS_PORTSC_0) Over-current Change (read/write clear) Position */
#define UHPHS_PORTSC_0_OCC_Msk                (_U_(0x1) << UHPHS_PORTSC_0_OCC_Pos)                 /**< (UHPHS_PORTSC_0) Over-current Change (read/write clear) Mask */
#define UHPHS_PORTSC_0_OCC(value)             (UHPHS_PORTSC_0_OCC_Msk & ((value) << UHPHS_PORTSC_0_OCC_Pos))
#define UHPHS_PORTSC_0_FPR_Pos                _U_(6)                                               /**< (UHPHS_PORTSC_0) Force Port Resume (read/write) Position */
#define UHPHS_PORTSC_0_FPR_Msk                (_U_(0x1) << UHPHS_PORTSC_0_FPR_Pos)                 /**< (UHPHS_PORTSC_0) Force Port Resume (read/write) Mask */
#define UHPHS_PORTSC_0_FPR(value)             (UHPHS_PORTSC_0_FPR_Msk & ((value) << UHPHS_PORTSC_0_FPR_Pos))
#define UHPHS_PORTSC_0_SUS_Pos                _U_(7)                                               /**< (UHPHS_PORTSC_0) Suspend (read/write) Position */
#define UHPHS_PORTSC_0_SUS_Msk                (_U_(0x1) << UHPHS_PORTSC_0_SUS_Pos)                 /**< (UHPHS_PORTSC_0) Suspend (read/write) Mask */
#define UHPHS_PORTSC_0_SUS(value)             (UHPHS_PORTSC_0_SUS_Msk & ((value) << UHPHS_PORTSC_0_SUS_Pos))
#define UHPHS_PORTSC_0_PR_Pos                 _U_(8)                                               /**< (UHPHS_PORTSC_0) Port Reset (read/write) Position */
#define UHPHS_PORTSC_0_PR_Msk                 (_U_(0x1) << UHPHS_PORTSC_0_PR_Pos)                  /**< (UHPHS_PORTSC_0) Port Reset (read/write) Mask */
#define UHPHS_PORTSC_0_PR(value)              (UHPHS_PORTSC_0_PR_Msk & ((value) << UHPHS_PORTSC_0_PR_Pos))
#define UHPHS_PORTSC_0_LS_Pos                 _U_(10)                                              /**< (UHPHS_PORTSC_0) Line Status (read-only) Position */
#define UHPHS_PORTSC_0_LS_Msk                 (_U_(0x3) << UHPHS_PORTSC_0_LS_Pos)                  /**< (UHPHS_PORTSC_0) Line Status (read-only) Mask */
#define UHPHS_PORTSC_0_LS(value)              (UHPHS_PORTSC_0_LS_Msk & ((value) << UHPHS_PORTSC_0_LS_Pos))
#define UHPHS_PORTSC_0_PP_Pos                 _U_(12)                                              /**< (UHPHS_PORTSC_0) Port Power (read/write or read-only) Position */
#define UHPHS_PORTSC_0_PP_Msk                 (_U_(0x1) << UHPHS_PORTSC_0_PP_Pos)                  /**< (UHPHS_PORTSC_0) Port Power (read/write or read-only) Mask */
#define UHPHS_PORTSC_0_PP(value)              (UHPHS_PORTSC_0_PP_Msk & ((value) << UHPHS_PORTSC_0_PP_Pos))
#define UHPHS_PORTSC_0_PO_Pos                 _U_(13)                                              /**< (UHPHS_PORTSC_0) Port Owner (read/write) Position */
#define UHPHS_PORTSC_0_PO_Msk                 (_U_(0x1) << UHPHS_PORTSC_0_PO_Pos)                  /**< (UHPHS_PORTSC_0) Port Owner (read/write) Mask */
#define UHPHS_PORTSC_0_PO(value)              (UHPHS_PORTSC_0_PO_Msk & ((value) << UHPHS_PORTSC_0_PO_Pos))
#define UHPHS_PORTSC_0_PIC_Pos                _U_(14)                                              /**< (UHPHS_PORTSC_0) Port Indicator Control (read/write) Position */
#define UHPHS_PORTSC_0_PIC_Msk                (_U_(0x3) << UHPHS_PORTSC_0_PIC_Pos)                 /**< (UHPHS_PORTSC_0) Port Indicator Control (read/write) Mask */
#define UHPHS_PORTSC_0_PIC(value)             (UHPHS_PORTSC_0_PIC_Msk & ((value) << UHPHS_PORTSC_0_PIC_Pos))
#define UHPHS_PORTSC_0_PTC_Pos                _U_(16)                                              /**< (UHPHS_PORTSC_0) Port Test Control (read/write) Position */
#define UHPHS_PORTSC_0_PTC_Msk                (_U_(0xF) << UHPHS_PORTSC_0_PTC_Pos)                 /**< (UHPHS_PORTSC_0) Port Test Control (read/write) Mask */
#define UHPHS_PORTSC_0_PTC(value)             (UHPHS_PORTSC_0_PTC_Msk & ((value) << UHPHS_PORTSC_0_PTC_Pos))
#define UHPHS_PORTSC_0_WKCNNT_E_Pos           _U_(20)                                              /**< (UHPHS_PORTSC_0) Wake on Connect Enable (read/write) Position */
#define UHPHS_PORTSC_0_WKCNNT_E_Msk           (_U_(0x1) << UHPHS_PORTSC_0_WKCNNT_E_Pos)            /**< (UHPHS_PORTSC_0) Wake on Connect Enable (read/write) Mask */
#define UHPHS_PORTSC_0_WKCNNT_E(value)        (UHPHS_PORTSC_0_WKCNNT_E_Msk & ((value) << UHPHS_PORTSC_0_WKCNNT_E_Pos))
#define UHPHS_PORTSC_0_WKDSCNNT_E_Pos         _U_(21)                                              /**< (UHPHS_PORTSC_0) Wake on Disconnect Enable (read/write) Position */
#define UHPHS_PORTSC_0_WKDSCNNT_E_Msk         (_U_(0x1) << UHPHS_PORTSC_0_WKDSCNNT_E_Pos)          /**< (UHPHS_PORTSC_0) Wake on Disconnect Enable (read/write) Mask */
#define UHPHS_PORTSC_0_WKDSCNNT_E(value)      (UHPHS_PORTSC_0_WKDSCNNT_E_Msk & ((value) << UHPHS_PORTSC_0_WKDSCNNT_E_Pos))
#define UHPHS_PORTSC_0_WKOC_E_Pos             _U_(22)                                              /**< (UHPHS_PORTSC_0) Wake on Over-current Enable (read/write) Position */
#define UHPHS_PORTSC_0_WKOC_E_Msk             (_U_(0x1) << UHPHS_PORTSC_0_WKOC_E_Pos)              /**< (UHPHS_PORTSC_0) Wake on Over-current Enable (read/write) Mask */
#define UHPHS_PORTSC_0_WKOC_E(value)          (UHPHS_PORTSC_0_WKOC_E_Msk & ((value) << UHPHS_PORTSC_0_WKOC_E_Pos))
#define UHPHS_PORTSC_0_Msk                    _U_(0x007FFDFF)                                      /**< (UHPHS_PORTSC_0) Register Mask  */


/* -------- UHPHS_PORTSC_1 : (UHPHS Offset: 0x58) (R/W 32) UHPHS Port Status and Control Register 1 -------- */
#define UHPHS_PORTSC_1_CCS_Pos                _U_(0)                                               /**< (UHPHS_PORTSC_1) Current Connect Status (read-only) Position */
#define UHPHS_PORTSC_1_CCS_Msk                (_U_(0x1) << UHPHS_PORTSC_1_CCS_Pos)                 /**< (UHPHS_PORTSC_1) Current Connect Status (read-only) Mask */
#define UHPHS_PORTSC_1_CCS(value)             (UHPHS_PORTSC_1_CCS_Msk & ((value) << UHPHS_PORTSC_1_CCS_Pos))
#define UHPHS_PORTSC_1_CSC_Pos                _U_(1)                                               /**< (UHPHS_PORTSC_1) Connect Status Change (read/write clear) Position */
#define UHPHS_PORTSC_1_CSC_Msk                (_U_(0x1) << UHPHS_PORTSC_1_CSC_Pos)                 /**< (UHPHS_PORTSC_1) Connect Status Change (read/write clear) Mask */
#define UHPHS_PORTSC_1_CSC(value)             (UHPHS_PORTSC_1_CSC_Msk & ((value) << UHPHS_PORTSC_1_CSC_Pos))
#define UHPHS_PORTSC_1_PED_Pos                _U_(2)                                               /**< (UHPHS_PORTSC_1) Port Enabled/Disabled (read/write) Position */
#define UHPHS_PORTSC_1_PED_Msk                (_U_(0x1) << UHPHS_PORTSC_1_PED_Pos)                 /**< (UHPHS_PORTSC_1) Port Enabled/Disabled (read/write) Mask */
#define UHPHS_PORTSC_1_PED(value)             (UHPHS_PORTSC_1_PED_Msk & ((value) << UHPHS_PORTSC_1_PED_Pos))
#define UHPHS_PORTSC_1_PEDC_Pos               _U_(3)                                               /**< (UHPHS_PORTSC_1) Port Enable/Disable Change (read/write clear) Position */
#define UHPHS_PORTSC_1_PEDC_Msk               (_U_(0x1) << UHPHS_PORTSC_1_PEDC_Pos)                /**< (UHPHS_PORTSC_1) Port Enable/Disable Change (read/write clear) Mask */
#define UHPHS_PORTSC_1_PEDC(value)            (UHPHS_PORTSC_1_PEDC_Msk & ((value) << UHPHS_PORTSC_1_PEDC_Pos))
#define UHPHS_PORTSC_1_OCA_Pos                _U_(4)                                               /**< (UHPHS_PORTSC_1) Over-current Active (read-only) Position */
#define UHPHS_PORTSC_1_OCA_Msk                (_U_(0x1) << UHPHS_PORTSC_1_OCA_Pos)                 /**< (UHPHS_PORTSC_1) Over-current Active (read-only) Mask */
#define UHPHS_PORTSC_1_OCA(value)             (UHPHS_PORTSC_1_OCA_Msk & ((value) << UHPHS_PORTSC_1_OCA_Pos))
#define UHPHS_PORTSC_1_OCC_Pos                _U_(5)                                               /**< (UHPHS_PORTSC_1) Over-current Change (read/write clear) Position */
#define UHPHS_PORTSC_1_OCC_Msk                (_U_(0x1) << UHPHS_PORTSC_1_OCC_Pos)                 /**< (UHPHS_PORTSC_1) Over-current Change (read/write clear) Mask */
#define UHPHS_PORTSC_1_OCC(value)             (UHPHS_PORTSC_1_OCC_Msk & ((value) << UHPHS_PORTSC_1_OCC_Pos))
#define UHPHS_PORTSC_1_FPR_Pos                _U_(6)                                               /**< (UHPHS_PORTSC_1) Force Port Resume (read/write) Position */
#define UHPHS_PORTSC_1_FPR_Msk                (_U_(0x1) << UHPHS_PORTSC_1_FPR_Pos)                 /**< (UHPHS_PORTSC_1) Force Port Resume (read/write) Mask */
#define UHPHS_PORTSC_1_FPR(value)             (UHPHS_PORTSC_1_FPR_Msk & ((value) << UHPHS_PORTSC_1_FPR_Pos))
#define UHPHS_PORTSC_1_SUS_Pos                _U_(7)                                               /**< (UHPHS_PORTSC_1) Suspend (read/write) Position */
#define UHPHS_PORTSC_1_SUS_Msk                (_U_(0x1) << UHPHS_PORTSC_1_SUS_Pos)                 /**< (UHPHS_PORTSC_1) Suspend (read/write) Mask */
#define UHPHS_PORTSC_1_SUS(value)             (UHPHS_PORTSC_1_SUS_Msk & ((value) << UHPHS_PORTSC_1_SUS_Pos))
#define UHPHS_PORTSC_1_PR_Pos                 _U_(8)                                               /**< (UHPHS_PORTSC_1) Port Reset (read/write) Position */
#define UHPHS_PORTSC_1_PR_Msk                 (_U_(0x1) << UHPHS_PORTSC_1_PR_Pos)                  /**< (UHPHS_PORTSC_1) Port Reset (read/write) Mask */
#define UHPHS_PORTSC_1_PR(value)              (UHPHS_PORTSC_1_PR_Msk & ((value) << UHPHS_PORTSC_1_PR_Pos))
#define UHPHS_PORTSC_1_LS_Pos                 _U_(10)                                              /**< (UHPHS_PORTSC_1) Line Status (read-only) Position */
#define UHPHS_PORTSC_1_LS_Msk                 (_U_(0x3) << UHPHS_PORTSC_1_LS_Pos)                  /**< (UHPHS_PORTSC_1) Line Status (read-only) Mask */
#define UHPHS_PORTSC_1_LS(value)              (UHPHS_PORTSC_1_LS_Msk & ((value) << UHPHS_PORTSC_1_LS_Pos))
#define UHPHS_PORTSC_1_PP_Pos                 _U_(12)                                              /**< (UHPHS_PORTSC_1) Port Power (read/write or read-only) Position */
#define UHPHS_PORTSC_1_PP_Msk                 (_U_(0x1) << UHPHS_PORTSC_1_PP_Pos)                  /**< (UHPHS_PORTSC_1) Port Power (read/write or read-only) Mask */
#define UHPHS_PORTSC_1_PP(value)              (UHPHS_PORTSC_1_PP_Msk & ((value) << UHPHS_PORTSC_1_PP_Pos))
#define UHPHS_PORTSC_1_PO_Pos                 _U_(13)                                              /**< (UHPHS_PORTSC_1) Port Owner (read/write) Position */
#define UHPHS_PORTSC_1_PO_Msk                 (_U_(0x1) << UHPHS_PORTSC_1_PO_Pos)                  /**< (UHPHS_PORTSC_1) Port Owner (read/write) Mask */
#define UHPHS_PORTSC_1_PO(value)              (UHPHS_PORTSC_1_PO_Msk & ((value) << UHPHS_PORTSC_1_PO_Pos))
#define UHPHS_PORTSC_1_PIC_Pos                _U_(14)                                              /**< (UHPHS_PORTSC_1) Port Indicator Control (read/write) Position */
#define UHPHS_PORTSC_1_PIC_Msk                (_U_(0x3) << UHPHS_PORTSC_1_PIC_Pos)                 /**< (UHPHS_PORTSC_1) Port Indicator Control (read/write) Mask */
#define UHPHS_PORTSC_1_PIC(value)             (UHPHS_PORTSC_1_PIC_Msk & ((value) << UHPHS_PORTSC_1_PIC_Pos))
#define UHPHS_PORTSC_1_PTC_Pos                _U_(16)                                              /**< (UHPHS_PORTSC_1) Port Test Control (read/write) Position */
#define UHPHS_PORTSC_1_PTC_Msk                (_U_(0xF) << UHPHS_PORTSC_1_PTC_Pos)                 /**< (UHPHS_PORTSC_1) Port Test Control (read/write) Mask */
#define UHPHS_PORTSC_1_PTC(value)             (UHPHS_PORTSC_1_PTC_Msk & ((value) << UHPHS_PORTSC_1_PTC_Pos))
#define UHPHS_PORTSC_1_WKCNNT_E_Pos           _U_(20)                                              /**< (UHPHS_PORTSC_1) Wake on Connect Enable (read/write) Position */
#define UHPHS_PORTSC_1_WKCNNT_E_Msk           (_U_(0x1) << UHPHS_PORTSC_1_WKCNNT_E_Pos)            /**< (UHPHS_PORTSC_1) Wake on Connect Enable (read/write) Mask */
#define UHPHS_PORTSC_1_WKCNNT_E(value)        (UHPHS_PORTSC_1_WKCNNT_E_Msk & ((value) << UHPHS_PORTSC_1_WKCNNT_E_Pos))
#define UHPHS_PORTSC_1_WKDSCNNT_E_Pos         _U_(21)                                              /**< (UHPHS_PORTSC_1) Wake on Disconnect Enable (read/write) Position */
#define UHPHS_PORTSC_1_WKDSCNNT_E_Msk         (_U_(0x1) << UHPHS_PORTSC_1_WKDSCNNT_E_Pos)          /**< (UHPHS_PORTSC_1) Wake on Disconnect Enable (read/write) Mask */
#define UHPHS_PORTSC_1_WKDSCNNT_E(value)      (UHPHS_PORTSC_1_WKDSCNNT_E_Msk & ((value) << UHPHS_PORTSC_1_WKDSCNNT_E_Pos))
#define UHPHS_PORTSC_1_WKOC_E_Pos             _U_(22)                                              /**< (UHPHS_PORTSC_1) Wake on Over-current Enable (read/write) Position */
#define UHPHS_PORTSC_1_WKOC_E_Msk             (_U_(0x1) << UHPHS_PORTSC_1_WKOC_E_Pos)              /**< (UHPHS_PORTSC_1) Wake on Over-current Enable (read/write) Mask */
#define UHPHS_PORTSC_1_WKOC_E(value)          (UHPHS_PORTSC_1_WKOC_E_Msk & ((value) << UHPHS_PORTSC_1_WKOC_E_Pos))
#define UHPHS_PORTSC_1_Msk                    _U_(0x007FFDFF)                                      /**< (UHPHS_PORTSC_1) Register Mask  */


