virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/uhphs.h
/* -------- UHPHS_PORTSC_2 : (UHPHS Offset: 0x5C) (R/W 32) UHPHS Port Status and Control Register 2 -------- */
#define UHPHS_PORTSC_2_CCS_Pos                _U_(0)                                               /**< (UHPHS_PORTSC_2) Current Connect Status (read-only) Position */
#define UHPHS_PORTSC_2_CCS_Msk                (_U_(0x1) << UHPHS_PORTSC_2_CCS_Pos)                 /**< (UHPHS_PORTSC_2) Current Connect Status (read-only) Mask */
#define UHPHS_PORTSC_2_CCS(value)             (UHPHS_PORTSC_2_CCS_Msk & ((value) << UHPHS_PORTSC_2_CCS_Pos))
#define UHPHS_PORTSC_2_CSC_Pos                _U_(1)                                               /**< (UHPHS_PORTSC_2) Connect Status Change (read/write clear) Position */
#define UHPHS_PORTSC_2_CSC_Msk                (_U_(0x1) << UHPHS_PORTSC_2_CSC_Pos)                 /**< (UHPHS_PORTSC_2) Connect Status Change (read/write clear) Mask */
#define UHPHS_PORTSC_2_CSC(value)             (UHPHS_PORTSC_2_CSC_Msk & ((value) << UHPHS_PORTSC_2_CSC_Pos))
#define UHPHS_PORTSC_2_PED_Pos                _U_(2)                                               /**< (UHPHS_PORTSC_2) Port Enabled/Disabled (read/write) Position */
#define UHPHS_PORTSC_2_PED_Msk                (_U_(0x1) << UHPHS_PORTSC_2_PED_Pos)                 /**< (UHPHS_PORTSC_2) Port Enabled/Disabled (read/write) Mask */
#define UHPHS_PORTSC_2_PED(value)             (UHPHS_PORTSC_2_PED_Msk & ((value) << UHPHS_PORTSC_2_PED_Pos))
#define UHPHS_PORTSC_2_PEDC_Pos               _U_(3)                                               /**< (UHPHS_PORTSC_2) Port Enable/Disable Change (read/write clear) Position */
#define UHPHS_PORTSC_2_PEDC_Msk               (_U_(0x1) << UHPHS_PORTSC_2_PEDC_Pos)                /**< (UHPHS_PORTSC_2) Port Enable/Disable Change (read/write clear) Mask */
#define UHPHS_PORTSC_2_PEDC(value)            (UHPHS_PORTSC_2_PEDC_Msk & ((value) << UHPHS_PORTSC_2_PEDC_Pos))
#define UHPHS_PORTSC_2_OCA_Pos                _U_(4)                                               /**< (UHPHS_PORTSC_2) Over-current Active (read-only) Position */
#define UHPHS_PORTSC_2_OCA_Msk                (_U_(0x1) << UHPHS_PORTSC_2_OCA_Pos)                 /**< (UHPHS_PORTSC_2) Over-current Active (read-only) Mask */
#define UHPHS_PORTSC_2_OCA(value)             (UHPHS_PORTSC_2_OCA_Msk & ((value) << UHPHS_PORTSC_2_OCA_Pos))
#define UHPHS_PORTSC_2_OCC_Pos                _U_(5)                                               /**< (UHPHS_PORTSC_2) Over-current Change (read/write clear) Position */
#define UHPHS_PORTSC_2_OCC_Msk                (_U_(0x1) << UHPHS_PORTSC_2_OCC_Pos)                 /**< (UHPHS_PORTSC_2) Over-current Change (read/write clear) Mask */
#define UHPHS_PORTSC_2_OCC(value)             (UHPHS_PORTSC_2_OCC_Msk & ((value) << UHPHS_PORTSC_2_OCC_Pos))
#define UHPHS_PORTSC_2_FPR_Pos                _U_(6)                                               /**< (UHPHS_PORTSC_2) Force Port Resume (read/write) Position */
#define UHPHS_PORTSC_2_FPR_Msk                (_U_(0x1) << UHPHS_PORTSC_2_FPR_Pos)                 /**< (UHPHS_PORTSC_2) Force Port Resume (read/write) Mask */
#define UHPHS_PORTSC_2_FPR(value)             (UHPHS_PORTSC_2_FPR_Msk & ((value) << UHPHS_PORTSC_2_FPR_Pos))
#define UHPHS_PORTSC_2_SUS_Pos                _U_(7)                                               /**< (UHPHS_PORTSC_2) Suspend (read/write) Position */
#define UHPHS_PORTSC_2_SUS_Msk                (_U_(0x1) << UHPHS_PORTSC_2_SUS_Pos)                 /**< (UHPHS_PORTSC_2) Suspend (read/write) Mask */
#define UHPHS_PORTSC_2_SUS(value)             (UHPHS_PORTSC_2_SUS_Msk & ((value) << UHPHS_PORTSC_2_SUS_Pos))
#define UHPHS_PORTSC_2_PR_Pos                 _U_(8)                                               /**< (UHPHS_PORTSC_2) Port Reset (read/write) Position */
#define UHPHS_PORTSC_2_PR_Msk                 (_U_(0x1) << UHPHS_PORTSC_2_PR_Pos)                  /**< (UHPHS_PORTSC_2) Port Reset (read/write) Mask */
#define UHPHS_PORTSC_2_PR(value)              (UHPHS_PORTSC_2_PR_Msk & ((value) << UHPHS_PORTSC_2_PR_Pos))
#define UHPHS_PORTSC_2_LS_Pos                 _U_(10)                                              /**< (UHPHS_PORTSC_2) Line Status (read-only) Position */
#define UHPHS_PORTSC_2_LS_Msk                 (_U_(0x3) << UHPHS_PORTSC_2_LS_Pos)                  /**< (UHPHS_PORTSC_2) Line Status (read-only) Mask */
#define UHPHS_PORTSC_2_LS(value)              (UHPHS_PORTSC_2_LS_Msk & ((value) << UHPHS_PORTSC_2_LS_Pos))
#define UHPHS_PORTSC_2_PP_Pos                 _U_(12)                                              /**< (UHPHS_PORTSC_2) Port Power (read/write or read-only) Position */
#define UHPHS_PORTSC_2_PP_Msk                 (_U_(0x1) << UHPHS_PORTSC_2_PP_Pos)                  /**< (UHPHS_PORTSC_2) Port Power (read/write or read-only) Mask */
#define UHPHS_PORTSC_2_PP(value)              (UHPHS_PORTSC_2_PP_Msk & ((value) << UHPHS_PORTSC_2_PP_Pos))
#define UHPHS_PORTSC_2_PO_Pos                 _U_(13)                                              /**< (UHPHS_PORTSC_2) Port Owner (read/write) Position */
#define UHPHS_PORTSC_2_PO_Msk                 (_U_(0x1) << UHPHS_PORTSC_2_PO_Pos)                  /**< (UHPHS_PORTSC_2) Port Owner (read/write) Mask */
#define UHPHS_PORTSC_2_PO(value)              (UHPHS_PORTSC_2_PO_Msk & ((value) << UHPHS_PORTSC_2_PO_Pos))
#define UHPHS_PORTSC_2_PIC_Pos                _U_(14)                                              /**< (UHPHS_PORTSC_2) Port Indicator Control (read/write) Position */
#define UHPHS_PORTSC_2_PIC_Msk                (_U_(0x3) << UHPHS_PORTSC_2_PIC_Pos)                 /**< (UHPHS_PORTSC_2) Port Indicator Control (read/write) Mask */
#define UHPHS_PORTSC_2_PIC(value)             (UHPHS_PORTSC_2_PIC_Msk & ((value) << UHPHS_PORTSC_2_PIC_Pos))
#define UHPHS_PORTSC_2_PTC_Pos                _U_(16)                                              /**< (UHPHS_PORTSC_2) Port Test Control (read/write) Position */
#define UHPHS_PORTSC_2_PTC_Msk                (_U_(0xF) << UHPHS_PORTSC_2_PTC_Pos)                 /**< (UHPHS_PORTSC_2) Port Test Control (read/write) Mask */
#define UHPHS_PORTSC_2_PTC(value)             (UHPHS_PORTSC_2_PTC_Msk & ((value) << UHPHS_PORTSC_2_PTC_Pos))
#define UHPHS_PORTSC_2_WKCNNT_E_Pos           _U_(20)                                              /**< (UHPHS_PORTSC_2) Wake on Connect Enable (read/write) Position */
#define UHPHS_PORTSC_2_WKCNNT_E_Msk           (_U_(0x1) << UHPHS_PORTSC_2_WKCNNT_E_Pos)            /**< (UHPHS_PORTSC_2) Wake on Connect Enable (read/write) Mask */
#define UHPHS_PORTSC_2_WKCNNT_E(value)        (UHPHS_PORTSC_2_WKCNNT_E_Msk & ((value) << UHPHS_PORTSC_2_WKCNNT_E_Pos))
#define UHPHS_PORTSC_2_WKDSCNNT_E_Pos         _U_(21)                                              /**< (UHPHS_PORTSC_2) Wake on Disconnect Enable (read/write) Position */
#define UHPHS_PORTSC_2_WKDSCNNT_E_Msk         (_U_(0x1) << UHPHS_PORTSC_2_WKDSCNNT_E_Pos)          /**< (UHPHS_PORTSC_2) Wake on Disconnect Enable (read/write) Mask */
#define UHPHS_PORTSC_2_WKDSCNNT_E(value)      (UHPHS_PORTSC_2_WKDSCNNT_E_Msk & ((value) << UHPHS_PORTSC_2_WKDSCNNT_E_Pos))
#define UHPHS_PORTSC_2_WKOC_E_Pos             _U_(22)                                              /**< (UHPHS_PORTSC_2) Wake on Over-current Enable (read/write) Position */
#define UHPHS_PORTSC_2_WKOC_E_Msk             (_U_(0x1) << UHPHS_PORTSC_2_WKOC_E_Pos)              /**< (UHPHS_PORTSC_2) Wake on Over-current Enable (read/write) Mask */
#define UHPHS_PORTSC_2_WKOC_E(value)          (UHPHS_PORTSC_2_WKOC_E_Msk & ((value) << UHPHS_PORTSC_2_WKOC_E_Pos))
#define UHPHS_PORTSC_2_Msk                    _U_(0x007FFDFF)                                      /**< (UHPHS_PORTSC_2) Register Mask  */


/* -------- UHPHS_INSNREG00 : (UHPHS Offset: 0x90) (R/W 32) EHCI Synopsys-Specific Registers 00 -------- */
#define UHPHS_INSNREG00_En_Pos                _U_(0)                                               /**< (UHPHS_INSNREG00) Enable this Register Position */
#define UHPHS_INSNREG00_En_Msk                (_U_(0x1) << UHPHS_INSNREG00_En_Pos)                 /**< (UHPHS_INSNREG00) Enable this Register Mask */
#define UHPHS_INSNREG00_En(value)             (UHPHS_INSNREG00_En_Msk & ((value) << UHPHS_INSNREG00_En_Pos))
#define UHPHS_INSNREG00_MFC_16_Pos            _U_(1)                                               /**< (UHPHS_INSNREG00) Microframe Counter with Word Byte Interface Position */
#define UHPHS_INSNREG00_MFC_16_Msk            (_U_(0x7FF) << UHPHS_INSNREG00_MFC_16_Pos)           /**< (UHPHS_INSNREG00) Microframe Counter with Word Byte Interface Mask */
#define UHPHS_INSNREG00_MFC_16(value)         (UHPHS_INSNREG00_MFC_16_Msk & ((value) << UHPHS_INSNREG00_MFC_16_Pos))
#define UHPHS_INSNREG00_MFC_8_Pos             _U_(12)                                              /**< (UHPHS_INSNREG00) Microframe Counter with Byte Interface Position */
#define UHPHS_INSNREG00_MFC_8_Msk             (_U_(0x3) << UHPHS_INSNREG00_MFC_8_Pos)              /**< (UHPHS_INSNREG00) Microframe Counter with Byte Interface Mask */
#define UHPHS_INSNREG00_MFC_8(value)          (UHPHS_INSNREG00_MFC_8_Msk & ((value) << UHPHS_INSNREG00_MFC_8_Pos))
#define UHPHS_INSNREG00_Debug_Pos             _U_(14)                                              /**< (UHPHS_INSNREG00) Debug Purposes Position */
#define UHPHS_INSNREG00_Debug_Msk             (_U_(0x3F) << UHPHS_INSNREG00_Debug_Pos)             /**< (UHPHS_INSNREG00) Debug Purposes Mask */
#define UHPHS_INSNREG00_Debug(value)          (UHPHS_INSNREG00_Debug_Msk & ((value) << UHPHS_INSNREG00_Debug_Pos))
#define UHPHS_INSNREG00_Msk                   _U_(0x000FFFFF)                                      /**< (UHPHS_INSNREG00) Register Mask  */


