virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/uhphs.h
/* -------- UHPHS_INSNREG01 : (UHPHS Offset: 0x94) (R/W 32) EHCI Synopsys-Specific Registers 01 -------- */
#define UHPHS_INSNREG01_In_Threshold_Pos      _U_(0)                                               /**< (UHPHS_INSNREG01) Amount of Data Available in the IN Packet Buffer Position */
#define UHPHS_INSNREG01_In_Threshold_Msk      (_U_(0xFFFF) << UHPHS_INSNREG01_In_Threshold_Pos)    /**< (UHPHS_INSNREG01) Amount of Data Available in the IN Packet Buffer Mask */
#define UHPHS_INSNREG01_In_Threshold(value)   (UHPHS_INSNREG01_In_Threshold_Msk & ((value) << UHPHS_INSNREG01_In_Threshold_Pos))
#define UHPHS_INSNREG01_Out_Threshold_Pos     _U_(16)                                              /**< (UHPHS_INSNREG01) Amount of Data Available in the OUT Packet Buffer Position */
#define UHPHS_INSNREG01_Out_Threshold_Msk     (_U_(0xFFFF) << UHPHS_INSNREG01_Out_Threshold_Pos)   /**< (UHPHS_INSNREG01) Amount of Data Available in the OUT Packet Buffer Mask */
#define UHPHS_INSNREG01_Out_Threshold(value)  (UHPHS_INSNREG01_Out_Threshold_Msk & ((value) << UHPHS_INSNREG01_Out_Threshold_Pos))
#define UHPHS_INSNREG01_Msk                   _U_(0xFFFFFFFF)                                      /**< (UHPHS_INSNREG01) Register Mask  */


/* -------- UHPHS_INSNREG02 : (UHPHS Offset: 0x98) (R/W 32) EHCI Synopsys-Specific Registers 02 -------- */
#define UHPHS_INSNREG02_Dwords_Pos            _U_(0)                                               /**< (UHPHS_INSNREG02) Number of Entries Position */
#define UHPHS_INSNREG02_Dwords_Msk            (_U_(0xFFF) << UHPHS_INSNREG02_Dwords_Pos)           /**< (UHPHS_INSNREG02) Number of Entries Mask */
#define UHPHS_INSNREG02_Dwords(value)         (UHPHS_INSNREG02_Dwords_Msk & ((value) << UHPHS_INSNREG02_Dwords_Pos))
#define UHPHS_INSNREG02_Msk                   _U_(0x00000FFF)                                      /**< (UHPHS_INSNREG02) Register Mask  */


/* -------- UHPHS_INSNREG03 : (UHPHS Offset: 0x9C) (R/W 32) EHCI Synopsys-Specific Registers 03 -------- */
#define UHPHS_INSNREG03_Break_Mem_Pos         _U_(0)                                               /**< (UHPHS_INSNREG03) Break Memory Transfer (in CONFIG1 mode only, not applicable in CONFIG2 mode) Position */
#define UHPHS_INSNREG03_Break_Mem_Msk         (_U_(0x1) << UHPHS_INSNREG03_Break_Mem_Pos)          /**< (UHPHS_INSNREG03) Break Memory Transfer (in CONFIG1 mode only, not applicable in CONFIG2 mode) Mask */
#define UHPHS_INSNREG03_Break_Mem(value)      (UHPHS_INSNREG03_Break_Mem_Msk & ((value) << UHPHS_INSNREG03_Break_Mem_Pos))
#define UHPHS_INSNREG03_TA_Offset_Pos         _U_(1)                                               /**< (UHPHS_INSNREG03) Time-Available Offset Position */
#define UHPHS_INSNREG03_TA_Offset_Msk         (_U_(0xFF) << UHPHS_INSNREG03_TA_Offset_Pos)         /**< (UHPHS_INSNREG03) Time-Available Offset Mask */
#define UHPHS_INSNREG03_TA_Offset(value)      (UHPHS_INSNREG03_TA_Offset_Msk & ((value) << UHPHS_INSNREG03_TA_Offset_Pos))
#define UHPHS_INSNREG03_Per_Frame_Pos         _U_(9)                                               /**< (UHPHS_INSNREG03) Periodic Frame List Fetch Position */
#define UHPHS_INSNREG03_Per_Frame_Msk         (_U_(0x1) << UHPHS_INSNREG03_Per_Frame_Pos)          /**< (UHPHS_INSNREG03) Periodic Frame List Fetch Mask */
#define UHPHS_INSNREG03_Per_Frame(value)      (UHPHS_INSNREG03_Per_Frame_Msk & ((value) << UHPHS_INSNREG03_Per_Frame_Pos))
#define UHPHS_INSNREG03_T03_Tx_Pos            _U_(10)                                              /**< (UHPHS_INSNREG03) Tx-Tx Turnaround Delay Add-on Position */
#define UHPHS_INSNREG03_T03_Tx_Msk            (_U_(0x7) << UHPHS_INSNREG03_T03_Tx_Pos)             /**< (UHPHS_INSNREG03) Tx-Tx Turnaround Delay Add-on Mask */
#define UHPHS_INSNREG03_T03_Tx(value)         (UHPHS_INSNREG03_T03_Tx_Msk & ((value) << UHPHS_INSNREG03_T03_Tx_Pos))
#define UHPHS_INSNREG03_Ignore_LS_Pos         _U_(13)                                              /**< (UHPHS_INSNREG03) Ignore Linestate During TestSE0 Nak Position */
#define UHPHS_INSNREG03_Ignore_LS_Msk         (_U_(0x1) << UHPHS_INSNREG03_Ignore_LS_Pos)          /**< (UHPHS_INSNREG03) Ignore Linestate During TestSE0 Nak Mask */
#define UHPHS_INSNREG03_Ignore_LS(value)      (UHPHS_INSNREG03_Ignore_LS_Msk & ((value) << UHPHS_INSNREG03_Ignore_LS_Pos))
#define UHPHS_INSNREG03_EN_CK256_Pos          _U_(14)                                              /**< (UHPHS_INSNREG03) Enable 256 Clock Checking Position */
#define UHPHS_INSNREG03_EN_CK256_Msk          (_U_(0x1) << UHPHS_INSNREG03_EN_CK256_Pos)           /**< (UHPHS_INSNREG03) Enable 256 Clock Checking Mask */
#define UHPHS_INSNREG03_EN_CK256(value)       (UHPHS_INSNREG03_EN_CK256_Msk & ((value) << UHPHS_INSNREG03_EN_CK256_Pos))
#define UHPHS_INSNREG03_Msk                   _U_(0x00007FFF)                                      /**< (UHPHS_INSNREG03) Register Mask  */

#define UHPHS_INSNREG03_EN_CK_Pos             _U_(14)                                              /**< (UHPHS_INSNREG03 Position) Enable 256 Clock Checking */
#define UHPHS_INSNREG03_EN_CK_Msk             (_U_(0x1) << UHPHS_INSNREG03_EN_CK_Pos)              /**< (UHPHS_INSNREG03 Mask) EN_CK */
#define UHPHS_INSNREG03_EN_CK(value)          (UHPHS_INSNREG03_EN_CK_Msk & ((value) << UHPHS_INSNREG03_EN_CK_Pos)) 

/* -------- UHPHS_INSNREG04 : (UHPHS Offset: 0xA0) (R/W 32) EHCI Synopsys-Specific Registers 04 -------- */
#define UHPHS_INSNREG04_HCSPARAMS_W_Pos       _U_(0)                                               /**< (UHPHS_INSNREG04) HCSPARAMS Write Position */
#define UHPHS_INSNREG04_HCSPARAMS_W_Msk       (_U_(0x1) << UHPHS_INSNREG04_HCSPARAMS_W_Pos)        /**< (UHPHS_INSNREG04) HCSPARAMS Write Mask */
#define UHPHS_INSNREG04_HCSPARAMS_W(value)    (UHPHS_INSNREG04_HCSPARAMS_W_Msk & ((value) << UHPHS_INSNREG04_HCSPARAMS_W_Pos))
#define UHPHS_INSNREG04_HCCPARAMS_BW_Pos      _U_(1)                                               /**< (UHPHS_INSNREG04) HCCPARAMS Bits Write Position */
#define UHPHS_INSNREG04_HCCPARAMS_BW_Msk      (_U_(0x1) << UHPHS_INSNREG04_HCCPARAMS_BW_Pos)       /**< (UHPHS_INSNREG04) HCCPARAMS Bits Write Mask */
#define UHPHS_INSNREG04_HCCPARAMS_BW(value)   (UHPHS_INSNREG04_HCCPARAMS_BW_Msk & ((value) << UHPHS_INSNREG04_HCCPARAMS_BW_Pos))
#define UHPHS_INSNREG04_SDPE_TIME_Pos         _U_(2)                                               /**< (UHPHS_INSNREG04) Scales Down Port Enumeration Time Position */
#define UHPHS_INSNREG04_SDPE_TIME_Msk         (_U_(0x1) << UHPHS_INSNREG04_SDPE_TIME_Pos)          /**< (UHPHS_INSNREG04) Scales Down Port Enumeration Time Mask */
#define UHPHS_INSNREG04_SDPE_TIME(value)      (UHPHS_INSNREG04_SDPE_TIME_Msk & ((value) << UHPHS_INSNREG04_SDPE_TIME_Pos))
#define UHPHS_INSNREG04_NAK_RF_Pos            _U_(4)                                               /**< (UHPHS_INSNREG04) NAK Reload Fix (Read/Write) Position */
#define UHPHS_INSNREG04_NAK_RF_Msk            (_U_(0x1) << UHPHS_INSNREG04_NAK_RF_Pos)             /**< (UHPHS_INSNREG04) NAK Reload Fix (Read/Write) Mask */
#define UHPHS_INSNREG04_NAK_RF(value)         (UHPHS_INSNREG04_NAK_RF_Msk & ((value) << UHPHS_INSNREG04_NAK_RF_Pos))
#define UHPHS_INSNREG04_EN_AutoFunc_Pos       _U_(5)                                               /**< (UHPHS_INSNREG04) Enable Automatic Feature Position */
#define UHPHS_INSNREG04_EN_AutoFunc_Msk       (_U_(0x1) << UHPHS_INSNREG04_EN_AutoFunc_Pos)        /**< (UHPHS_INSNREG04) Enable Automatic Feature Mask */
#define UHPHS_INSNREG04_EN_AutoFunc(value)    (UHPHS_INSNREG04_EN_AutoFunc_Msk & ((value) << UHPHS_INSNREG04_EN_AutoFunc_Pos))
#define UHPHS_INSNREG04_Msk                   _U_(0x00000037)                                      /**< (UHPHS_INSNREG04) Register Mask  */


/* -------- UHPHS_INSNREG05 : (UHPHS Offset: 0xA4) (R/W 32) EHCI Synopsys-Specific Registers 05 -------- */
#define UHPHS_INSNREG05_VStatus_Pos           _U_(0)                                               /**< (UHPHS_INSNREG05) Vendor Status (Software RO) Position */
#define UHPHS_INSNREG05_VStatus_Msk           (_U_(0xFF) << UHPHS_INSNREG05_VStatus_Pos)           /**< (UHPHS_INSNREG05) Vendor Status (Software RO) Mask */
#define UHPHS_INSNREG05_VStatus(value)        (UHPHS_INSNREG05_VStatus_Msk & ((value) << UHPHS_INSNREG05_VStatus_Pos))
#define UHPHS_INSNREG05_VControl_Pos          _U_(8)                                               /**< (UHPHS_INSNREG05) Vendor Control (Software R/W) Position */
#define UHPHS_INSNREG05_VControl_Msk          (_U_(0xF) << UHPHS_INSNREG05_VControl_Pos)           /**< (UHPHS_INSNREG05) Vendor Control (Software R/W) Mask */
#define UHPHS_INSNREG05_VControl(value)       (UHPHS_INSNREG05_VControl_Msk & ((value) << UHPHS_INSNREG05_VControl_Pos))
#define UHPHS_INSNREG05_VControlLoadM_Pos     _U_(12)                                              /**< (UHPHS_INSNREG05) Vendor Control Load Microframe Position */
#define UHPHS_INSNREG05_VControlLoadM_Msk     (_U_(0x1) << UHPHS_INSNREG05_VControlLoadM_Pos)      /**< (UHPHS_INSNREG05) Vendor Control Load Microframe Mask */
#define UHPHS_INSNREG05_VControlLoadM(value)  (UHPHS_INSNREG05_VControlLoadM_Msk & ((value) << UHPHS_INSNREG05_VControlLoadM_Pos))
#define UHPHS_INSNREG05_VPort_Pos             _U_(13)                                              /**< (UHPHS_INSNREG05) Vendor Port (Software R/W) Position */
#define UHPHS_INSNREG05_VPort_Msk             (_U_(0xF) << UHPHS_INSNREG05_VPort_Pos)              /**< (UHPHS_INSNREG05) Vendor Port (Software R/W) Mask */
#define UHPHS_INSNREG05_VPort(value)          (UHPHS_INSNREG05_VPort_Msk & ((value) << UHPHS_INSNREG05_VPort_Pos))
#define UHPHS_INSNREG05_VBusy_Pos             _U_(17)                                              /**< (UHPHS_INSNREG05) Vendor Busy (Software RO) Position */
#define UHPHS_INSNREG05_VBusy_Msk             (_U_(0x1) << UHPHS_INSNREG05_VBusy_Pos)              /**< (UHPHS_INSNREG05) Vendor Busy (Software RO) Mask */
#define UHPHS_INSNREG05_VBusy(value)          (UHPHS_INSNREG05_VBusy_Msk & ((value) << UHPHS_INSNREG05_VBusy_Pos))
#define UHPHS_INSNREG05_Msk                   _U_(0x0003FFFF)                                      /**< (UHPHS_INSNREG05) Register Mask  */


/* -------- UHPHS_INSNREG06 : (UHPHS Offset: 0xA8) (R/W 32) EHCI Synopsys-Specific Registers 06 -------- */
#define UHPHS_INSNREG06_Nb_Success_Burst_Pos  _U_(0)                                               /**< (UHPHS_INSNREG06) Number of Successful Bursts (read-only)(1) Position */
#define UHPHS_INSNREG06_Nb_Success_Burst_Msk  (_U_(0xF) << UHPHS_INSNREG06_Nb_Success_Burst_Pos)   /**< (UHPHS_INSNREG06) Number of Successful Bursts (read-only)(1) Mask */
#define UHPHS_INSNREG06_Nb_Success_Burst(value) (UHPHS_INSNREG06_Nb_Success_Burst_Msk & ((value) << UHPHS_INSNREG06_Nb_Success_Burst_Pos))
#define UHPHS_INSNREG06_Nb_Burst_Pos          _U_(4)                                               /**< (UHPHS_INSNREG06) Number of Bursts (read-only)(1) Position */
#define UHPHS_INSNREG06_Nb_Burst_Msk          (_U_(0x1F) << UHPHS_INSNREG06_Nb_Burst_Pos)          /**< (UHPHS_INSNREG06) Number of Bursts (read-only)(1) Mask */
#define UHPHS_INSNREG06_Nb_Burst(value)       (UHPHS_INSNREG06_Nb_Burst_Msk & ((value) << UHPHS_INSNREG06_Nb_Burst_Pos))
#define UHPHS_INSNREG06_HBURST_Pos            _U_(9)                                               /**< (UHPHS_INSNREG06) Burst Value (read-only)(1) Position */
#define UHPHS_INSNREG06_HBURST_Msk            (_U_(0x7) << UHPHS_INSNREG06_HBURST_Pos)             /**< (UHPHS_INSNREG06) Burst Value (read-only)(1) Mask */
#define UHPHS_INSNREG06_HBURST(value)         (UHPHS_INSNREG06_HBURST_Msk & ((value) << UHPHS_INSNREG06_HBURST_Pos))
#define UHPHS_INSNREG06_AHB_ERR_Pos           _U_(31)                                              /**< (UHPHS_INSNREG06) AHB Error Position */
#define UHPHS_INSNREG06_AHB_ERR_Msk           (_U_(0x1) << UHPHS_INSNREG06_AHB_ERR_Pos)            /**< (UHPHS_INSNREG06) AHB Error Mask */
#define UHPHS_INSNREG06_AHB_ERR(value)        (UHPHS_INSNREG06_AHB_ERR_Msk & ((value) << UHPHS_INSNREG06_AHB_ERR_Pos))
#define UHPHS_INSNREG06_Msk                   _U_(0x80000FFF)                                      /**< (UHPHS_INSNREG06) Register Mask  */


/* -------- UHPHS_INSNREG07 : (UHPHS Offset: 0xAC) (R/W 32) EHCI Synopsys-Specific Registers 07 -------- */
#define UHPHS_INSNREG07_AHB_ADDR_Pos          _U_(0)                                               /**< (UHPHS_INSNREG07) AHB Address (read only) Position */
#define UHPHS_INSNREG07_AHB_ADDR_Msk          (_U_(0xFFFFFFFF) << UHPHS_INSNREG07_AHB_ADDR_Pos)    /**< (UHPHS_INSNREG07) AHB Address (read only) Mask */
#define UHPHS_INSNREG07_AHB_ADDR(value)       (UHPHS_INSNREG07_AHB_ADDR_Msk & ((value) << UHPHS_INSNREG07_AHB_ADDR_Pos))
#define UHPHS_INSNREG07_Msk                   _U_(0xFFFFFFFF)                                      /**< (UHPHS_INSNREG07) Register Mask  */


