virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/uhphs.h
/* -------- UHPHS_INSNREG08 : (UHPHS Offset: 0xB0) (R/W 32) EHCI Synopsys-Specific Registers 08 -------- */
#define UHPHS_INSNREG08_HSIC_EN_Pos           _U_(2)                                               /**< (UHPHS_INSNREG08) HSIC Enable/Disable Position */
#define UHPHS_INSNREG08_HSIC_EN_Msk           (_U_(0x1) << UHPHS_INSNREG08_HSIC_EN_Pos)            /**< (UHPHS_INSNREG08) HSIC Enable/Disable Mask */
#define UHPHS_INSNREG08_HSIC_EN(value)        (UHPHS_INSNREG08_HSIC_EN_Msk & ((value) << UHPHS_INSNREG08_HSIC_EN_Pos))
#define UHPHS_INSNREG08_Msk                   _U_(0x00000004)                                      /**< (UHPHS_INSNREG08) Register Mask  */


/** \brief UHPHS register offsets definitions */
#define UHPHS_HCCAPBASE_REG_OFST       (0x00)              /**< (UHPHS_HCCAPBASE) UHPHS Host Controller Capability Register Offset */
#define UHPHS_HCSPARAMS_REG_OFST       (0x04)              /**< (UHPHS_HCSPARAMS) UHPHS Host Controller Structural Parameters Register Offset */
#define UHPHS_HCCPARAMS_REG_OFST       (0x08)              /**< (UHPHS_HCCPARAMS) UHPHS Host Controller Capability Parameters Register Offset */
#define UHPHS_USBCMD_REG_OFST          (0x10)              /**< (UHPHS_USBCMD) UHPHS USB Command Register Offset */
#define UHPHS_USBSTS_REG_OFST          (0x14)              /**< (UHPHS_USBSTS) UHPHS USB Status Register Offset */
#define UHPHS_USBINTR_REG_OFST         (0x18)              /**< (UHPHS_USBINTR) UHPHS USB Interrupt Enable Register Offset */
#define UHPHS_FRINDEX_REG_OFST         (0x1C)              /**< (UHPHS_FRINDEX) UHPHS USB Frame Index Register Offset */
#define UHPHS_CTRLDSSEGMENT_REG_OFST   (0x20)              /**< (UHPHS_CTRLDSSEGMENT) UHPHS Control Data Structure Segment Register Offset */
#define UHPHS_PERIODICLISTBASE_REG_OFST (0x24)              /**< (UHPHS_PERIODICLISTBASE) UHPHS Periodic Frame List Base Address Register Offset */
#define UHPHS_ASYNCLISTADDR_REG_OFST   (0x28)              /**< (UHPHS_ASYNCLISTADDR) UHPHS Asynchronous List Address Register Offset */
#define UHPHS_CONFIGFLAG_REG_OFST      (0x50)              /**< (UHPHS_CONFIGFLAG) UHPHS Configured Flag Register Offset */
#define UHPHS_PORTSC_0_REG_OFST        (0x54)              /**< (UHPHS_PORTSC_0) UHPHS Port Status and Control Register 0 Offset */
#define UHPHS_PORTSC_1_REG_OFST        (0x58)              /**< (UHPHS_PORTSC_1) UHPHS Port Status and Control Register 1 Offset */
#define UHPHS_PORTSC_2_REG_OFST        (0x5C)              /**< (UHPHS_PORTSC_2) UHPHS Port Status and Control Register 2 Offset */
#define UHPHS_INSNREG00_REG_OFST       (0x90)              /**< (UHPHS_INSNREG00) EHCI Synopsys-Specific Registers 00 Offset */
#define UHPHS_INSNREG01_REG_OFST       (0x94)              /**< (UHPHS_INSNREG01) EHCI Synopsys-Specific Registers 01 Offset */
#define UHPHS_INSNREG02_REG_OFST       (0x98)              /**< (UHPHS_INSNREG02) EHCI Synopsys-Specific Registers 02 Offset */
#define UHPHS_INSNREG03_REG_OFST       (0x9C)              /**< (UHPHS_INSNREG03) EHCI Synopsys-Specific Registers 03 Offset */
#define UHPHS_INSNREG04_REG_OFST       (0xA0)              /**< (UHPHS_INSNREG04) EHCI Synopsys-Specific Registers 04 Offset */
#define UHPHS_INSNREG05_REG_OFST       (0xA4)              /**< (UHPHS_INSNREG05) EHCI Synopsys-Specific Registers 05 Offset */
#define UHPHS_INSNREG06_REG_OFST       (0xA8)              /**< (UHPHS_INSNREG06) EHCI Synopsys-Specific Registers 06 Offset */
#define UHPHS_INSNREG07_REG_OFST       (0xAC)              /**< (UHPHS_INSNREG07) EHCI Synopsys-Specific Registers 07 Offset */
#define UHPHS_INSNREG08_REG_OFST       (0xB0)              /**< (UHPHS_INSNREG08) EHCI Synopsys-Specific Registers 08 Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief UHPHS register API structure */
typedef struct
{
  __I   uint32_t                       UHPHS_HCCAPBASE;    /**< Offset: 0x00 (R/   32) UHPHS Host Controller Capability Register */
  __I   uint32_t                       UHPHS_HCSPARAMS;    /**< Offset: 0x04 (R/   32) UHPHS Host Controller Structural Parameters Register */
  __I   uint32_t                       UHPHS_HCCPARAMS;    /**< Offset: 0x08 (R/   32) UHPHS Host Controller Capability Parameters Register */
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       UHPHS_USBCMD;       /**< Offset: 0x10 (R/W  32) UHPHS USB Command Register */
  __IO  uint32_t                       UHPHS_USBSTS;       /**< Offset: 0x14 (R/W  32) UHPHS USB Status Register */
  __IO  uint32_t                       UHPHS_USBINTR;      /**< Offset: 0x18 (R/W  32) UHPHS USB Interrupt Enable Register */
  __IO  uint32_t                       UHPHS_FRINDEX;      /**< Offset: 0x1C (R/W  32) UHPHS USB Frame Index Register */
  __IO  uint32_t                       UHPHS_CTRLDSSEGMENT; /**< Offset: 0x20 (R/W  32) UHPHS Control Data Structure Segment Register */
  __IO  uint32_t                       UHPHS_PERIODICLISTBASE; /**< Offset: 0x24 (R/W  32) UHPHS Periodic Frame List Base Address Register */
  __IO  uint32_t                       UHPHS_ASYNCLISTADDR; /**< Offset: 0x28 (R/W  32) UHPHS Asynchronous List Address Register */
  __I   uint8_t                        Reserved2[0x24];
  __IO  uint32_t                       UHPHS_CONFIGFLAG;   /**< Offset: 0x50 (R/W  32) UHPHS Configured Flag Register */
  __IO  uint32_t                       UHPHS_PORTSC_0;     /**< Offset: 0x54 (R/W  32) UHPHS Port Status and Control Register 0 */
  __IO  uint32_t                       UHPHS_PORTSC_1;     /**< Offset: 0x58 (R/W  32) UHPHS Port Status and Control Register 1 */
  __IO  uint32_t                       UHPHS_PORTSC_2;     /**< Offset: 0x5C (R/W  32) UHPHS Port Status and Control Register 2 */
  __I   uint8_t                        Reserved3[0x30];
  __IO  uint32_t                       UHPHS_INSNREG00;    /**< Offset: 0x90 (R/W  32) EHCI Synopsys-Specific Registers 00 */
  __IO  uint32_t                       UHPHS_INSNREG01;    /**< Offset: 0x94 (R/W  32) EHCI Synopsys-Specific Registers 01 */
  __IO  uint32_t                       UHPHS_INSNREG02;    /**< Offset: 0x98 (R/W  32) EHCI Synopsys-Specific Registers 02 */
  __IO  uint32_t                       UHPHS_INSNREG03;    /**< Offset: 0x9C (R/W  32) EHCI Synopsys-Specific Registers 03 */
  __IO  uint32_t                       UHPHS_INSNREG04;    /**< Offset: 0xA0 (R/W  32) EHCI Synopsys-Specific Registers 04 */
  __IO  uint32_t                       UHPHS_INSNREG05;    /**< Offset: 0xA4 (R/W  32) EHCI Synopsys-Specific Registers 05 */
  __IO  uint32_t                       UHPHS_INSNREG06;    /**< Offset: 0xA8 (R/W  32) EHCI Synopsys-Specific Registers 06 */
  __IO  uint32_t                       UHPHS_INSNREG07;    /**< Offset: 0xAC (R/W  32) EHCI Synopsys-Specific Registers 07 */
  __IO  uint32_t                       UHPHS_INSNREG08;    /**< Offset: 0xB0 (R/W  32) EHCI Synopsys-Specific Registers 08 */
} uhphs_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMA5D2_UHPHS_COMPONENT_H_ */
